{"config": {"layers": [{"config": {"name": "input_1", "ragged": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 64, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 64, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_1"}, "inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"strides": [2, 2], "dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 128, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_2"}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 128, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_3"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"strides": [2, 2], "dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 256, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_4"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 256, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_5"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 256, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_6"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"strides": [2, 2], "dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_7"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_8"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_9"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "bias_constraint": null, "name": "conv2d_10"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10"}, {"config": {"trainable": true, "dtype": "float32", "name": "subtract"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "class_name": "Subtract", "name": "subtract"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "bias_constraint": null, "name": "conv2d_11"}, "inbound_nodes": [[["subtract", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11"}, {"config": {"trainable": true, "dtype": "float32", "name": "multiply"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_12"}, "inbound_nodes": [[["multiply", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_13"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 512, "data_format": "channels_last", "padding": "same", "dilation_rate": [2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_14"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 256, "data_format": "channels_last", "padding": "same", "dilation_rate": [2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_15"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 128, "data_format": "channels_last", "padding": "same", "dilation_rate": [2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_16"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 64, "data_format": "channels_last", "padding": "same", "dilation_rate": [2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_17"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 1, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "bias_constraint": null, "name": "conv2d_18"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18"}], "output_layers": [["conv2d_18", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model"}, "keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow"}